[
  {
    "id": 1,
    "title": "Spaghetti Carbonara",
    "summary": "A classic Italian pasta dish with eggs, cheese, bacon, and black pepper.",
    "image": "https://via.placeholder.com/150",
    "ingredients": [
      "400g spaghetti",
      "200g pancetta or bacon",
      "4 large eggs",
      "100g Parmesan cheese, grated",
      "Black pepper to taste",
      "Salt for pasta water"
    ],
    "instructions": [
      "Bring a large pot of salted water to boil and cook spaghetti according to package directions.",
      "While pasta cooks, fry pancetta in a large skillet until crispy.",
      "In a bowl, whisk together eggs and Parmesan cheese.",
      "Drain pasta, reserving 1 cup of pasta water.",
      "Add hot pasta to the skillet with pancetta, remove from heat.",
      "Quickly stir in egg mixture, adding pasta water to create a creamy sauce.",
      "Season with black pepper and serve immediately."
    ]
  },
  {
    "id": 2,
    "title": "Chicken Tikka Masala",
    "summary": "Chunks of grilled chicken (tikka) cooked in a smooth buttery & creamy tomato based gravy.",
    "image": "https://via.placeholder.com/150",
    "ingredients": [
      "500g chicken breast, cubed",
      "1 cup yogurt",
      "2 tbsp tikka masala spice mix",
      "400g canned tomatoes",
      "1 cup heavy cream",
      "2 onions, diced",
      "4 cloves garlic, minced",
      "1 tbsp ginger, grated",
      "2 tbsp butter",
      "Fresh cilantro for garnish"
    ],
    "instructions": [
      "Marinate chicken in yogurt and half the tikka masala spice for 1 hour.",
      "Grill or pan-fry marinated chicken until cooked through.",
      "In a large pan, melt butter and sauté onions until golden.",
      "Add garlic and ginger, cook for 1 minute.",
      "Add remaining spices and cook until fragrant.",
      "Pour in canned tomatoes and simmer for 10 minutes.",
      "Stir in cream and cooked chicken, simmer for 5 minutes.",
      "Garnish with fresh cilantro and serve with rice or naan."
    ]
  },
  {
    "id": 3,
    "title": "Chocolate Chip Cookies",
    "summary": "Classic homemade cookies loaded with chocolate chips.",
    "image": "https://via.placeholder.com/150",
    "ingredients": [
      "2 1/4 cups all-purpose flour",
      "1 tsp baking soda",
      "1 tsp salt",
      "1 cup butter, softened",
      "3/4 cup granulated sugar",
      "3/4 cup packed brown sugar",
      "2 large eggs",
      "2 tsp vanilla extract",
      "2 cups chocolate chips"
    ],
    "instructions": [
      "Preheat oven to 375°F (190°C).",
      "Mix flour, baking soda, and salt in a bowl.",
      "In another bowl, beat butter and both sugars until creamy.",
      "Add eggs and vanilla to butter mixture, beat well.",
      "Gradually stir in flour mixture.",
      "Fold in chocolate chips.",
      "Drop rounded tablespoons of dough onto ungreased baking sheets.",
      "Bake 9-11 minutes or until golden brown.",
      "Cool on baking sheet for 2 minutes before transferring to wire rack."
    ]
  }
]